In [13]:
import pandas as pd

In [14]:
cli = pd.read_csv(r"C:\Data_Engineer_Study\멀캠_PJT_2\multi_finalproject\data\Mapping_data\KOR_CLI13~.csv")

In [15]:
cli = cli[['TIME', 'Value']]
cli.head()

      TIME     Value
0  2012-01  98.38203
1  2012-02  98.49286
2  2012-03  98.63561
3  2012-04  98.77065
4  2012-05  98.86687

In [16]:
def format_time(time_str):
    # 월의 약어를 숫자로 매핑하는 딕셔너리 생성
    month_mapping = {
        'Jan': '01',
        'Feb': '02',
        'Mar': '03',
        'Apr': '04',
        'May': '05',
        'Jun': '06',
        'Jul': '07',
        'Aug': '08',
        'Sep': '09',
        'Oct': '10',
        'Nov': '11',
        'Dec': '12'
    }
    
    # TIME 컬럼의 문자열을 분해하여 연도와 월을 추출
    year = '20' + time_str[:2]  # 연도는 앞 두 자리
    month = month_mapping[time_str[-3:]]  # 월은 마지막 세 자리
    
    # 연도와 월을 결합하여 원하는 형식으로 반환
    formatted_time = year + month
    
    return formatted_time

In [18]:
cli['TIME']

0      2012-01
1      2012-02
2      2012-03
3      2012-04
4      2012-05
        ...
135    2023-04
136    2023-05
137    2023-06
138    2023-07
139    2023-08
Name: TIME, Length: 140, dtype: object

In [19]:
# cli['TIME'] = cli['TIME'].apply(format_time)

In [22]:
cli['TIME'] = cli['TIME'].str.replace("-","")

In [23]:
# 매핑 대상 csv 불러오기
main = pd.read_excel(r"C:\Data_Engineer_Study\멀캠_PJT_2\multi_finalproject\data\Mapping_data\template_수정본.xlsx")

In [24]:
main.columns

Index(['년/월', '시도', '산업_대분류', '구인인원', '취업건수', '사업체 수', '실업급여 수급자 수',
       '각 지역별 인구', 'GDP(실질)', '금리', 'CLI 지수', '소비자 심리지수'],
      dtype='object')

In [25]:
main = main[['년/월', 'CLI 지수']]
main

          년/월    CLI 지수
0      201301       NaN
1      201301       NaN
2      201301       NaN
3      201301       NaN
4      201301       NaN
...       ...       ...
10195  202212  98.75089
10196  202212  98.75089
10197  202212  98.75089
10198  202212  98.75089
10199  202212  98.75089

[10200 rows x 2 columns]

In [27]:
# Dtype 확인
main.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   년/월     10200 non-null  int64
 1   CLI 지수  5100 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 159.5 KB

In [28]:
cli.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   TIME    140 non-null    object
 1   Value   140 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.3+ KB

In [29]:
cli['TIME'] = cli['TIME'].astype('int')

In [30]:
merged_df = main.merge(cli, left_on=['년/월'], right_on = ['TIME'], how='left')

In [31]:
merged_df

          년/월    CLI 지수    TIME     Value
0      201301       NaN  201301  99.14964
1      201301       NaN  201301  99.14964
2      201301       NaN  201301  99.14964
3      201301       NaN  201301  99.14964
4      201301       NaN  201301  99.14964
...       ...       ...     ...       ...
10195  202212  98.75089  202212  98.75089
10196  202212  98.75089  202212  98.75089
10197  202212  98.75089  202212  98.75089
10198  202212  98.75089  202212  98.75089
10199  202212  98.75089  202212  98.75089

[10200 rows x 4 columns]

In [32]:
merged_df.to_csv('cli_mapping.csv', encoding = 'ANSI', index = False)